; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	thermograph1 - mode
	image2 - mode
	infrared0 - mode
	Star3 - direction
	GroundStation2 - direction
	Star7 - direction
	Star0 - direction
	GroundStation5 - direction
	Star4 - direction
	GroundStation1 - direction
	GroundStation6 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Planet16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 infrared0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph1)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star3)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation5)
	(supports instrument5 infrared0)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon12)
	(supports instrument6 thermograph1)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star7)
	(supports instrument7 infrared0)
	(supports instrument7 thermograph1)
	(supports instrument7 image2)
	(calibration_target instrument7 GroundStation5)
	(supports instrument8 infrared0)
	(supports instrument8 thermograph1)
	(supports instrument8 image2)
	(calibration_target instrument8 GroundStation5)
	(calibration_target instrument8 Star0)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(supports instrument9 infrared0)
	(calibration_target instrument9 GroundStation1)
	(supports instrument10 thermograph1)
	(supports instrument10 image2)
	(supports instrument10 infrared0)
	(calibration_target instrument10 Star4)
	(supports instrument11 thermograph1)
	(calibration_target instrument11 GroundStation6)
	(calibration_target instrument11 GroundStation1)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
)
(:goal (and
	(pointing satellite0 Star7)
	(pointing satellite1 GroundStation5)
	(pointing satellite3 Star10)
	(have_image Planet8 thermograph1)
	(have_image Star9 thermograph1)
	(have_image Star10 infrared0)
	(have_image Star11 thermograph1)
	(have_image Phenomenon12 thermograph1)
	(have_image Phenomenon13 thermograph1)
	(have_image Phenomenon14 image2)
	(have_image Star15 thermograph1)
	(have_image Planet16 image2)
	(have_image Planet17 infrared0)
))

)

; plan
1. (turn_to satellite3 star4 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 star4)
   goals met: 0 of 13
2. (switch_on instrument10 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument10)
   goals met: 0 of 13
3. (calibrate satellite3 instrument10 star4)
   added: (calibrated instrument10)
   goals met: 0 of 13
4. (turn_to satellite3 planet17 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 planet17)
   goals met: 0 of 13
5. (take_image satellite3 planet17 instrument10 infrared0)
   added: (have_image planet17 infrared0)
   goals met: 1 of 13
6. (turn_to satellite3 planet16 planet17)
   deleted: (pointing satellite3 planet17)
   added: (pointing satellite3 planet16)
   goals met: 1 of 13
7. (take_image satellite3 planet16 instrument10 image2)
   added: (have_image planet16 image2)
   goals met: 2 of 13
8. (turn_to satellite3 phenomenon14 planet16)
   deleted: (pointing satellite3 planet16)
   added: (pointing satellite3 phenomenon14)
   goals met: 2 of 13
9. (take_image satellite3 phenomenon14 instrument10 image2)
   added: (have_image phenomenon14 image2)
   goals met: 3 of 13
10. (turn_to satellite3 phenomenon13 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 phenomenon13)
   goals met: 3 of 13
11. (take_image satellite3 phenomenon13 instrument10 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 4 of 13
12. (turn_to satellite3 phenomenon12 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon12)
   goals met: 4 of 13
13. (turn_to satellite0 star7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star7)
   goals met: 5 of 13
14. (take_image satellite3 phenomenon12 instrument10 thermograph1)
   added: (have_image phenomenon12 thermograph1)
   goals met: 6 of 13
15. (turn_to satellite1 groundstation5 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 groundstation5)
   goals met: 7 of 13
16. (turn_to satellite3 planet8 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 planet8)
   goals met: 7 of 13
17. (take_image satellite3 planet8 instrument10 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 8 of 13
18. (turn_to satellite3 star11 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 star11)
   goals met: 8 of 13
19. (take_image satellite3 star11 instrument10 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 9 of 13
20. (turn_to satellite3 star15 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star15)
   goals met: 9 of 13
21. (take_image satellite3 star15 instrument10 thermograph1)
   added: (have_image star15 thermograph1)
   goals met: 10 of 13
22. (turn_to satellite3 star9 star15)
   deleted: (pointing satellite3 star15)
   added: (pointing satellite3 star9)
   goals met: 10 of 13
23. (take_image satellite3 star9 instrument10 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 11 of 13
24. (turn_to satellite3 star10 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 star10)
   goals met: 12 of 13
25. (take_image satellite3 star10 instrument10 infrared0)
   added: (have_image star10 infrared0)
   goals met: 13 of 13
